src/k-bench-results/openYurt/reliability-worker/reliability-worker-2/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1461.67          ---          ---        12.43566        11.45500        26.11100        45.56700       112.60 
Gets        14615.05         5.33     14609.72        12.42840        11.45500        25.98300        45.56700       569.48 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      16076.72         5.33     14609.72        12.42906        11.45500        25.98300        45.56700       682.08 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.455        0.000
SET      10.175        5.000
SET      10.751       10.000
SET      10.943       15.000
SET      11.007       20.000
SET      11.135       25.000
SET      11.199       30.000
SET      11.263       35.000
SET      11.327       40.000
SET      11.391       45.000
SET      11.455       50.000
SET      11.455       52.500
SET      11.455       55.000
SET      11.519       57.500
SET      11.519       60.000
SET      11.583       62.500
SET      11.647       65.000
SET      11.647       67.500
SET      11.711       70.000
SET      11.775       72.500
SET      11.839       75.000
SET      11.903       76.250
SET      11.967       77.500
SET      12.031       78.750
SET      12.159       80.000
SET      12.287       81.250
SET      12.479       82.500
SET      12.799       83.750
SET      13.119       85.000
SET      13.503       86.250
SET      13.951       87.500
SET      14.143       88.125
SET      14.399       88.750
SET      14.719       89.375
SET      15.167       90.000
SET      15.871       90.625
SET      17.023       91.250
SET      18.559       91.875
SET      19.839       92.500
SET      20.735       93.125
SET      21.247       93.750
SET      21.503       94.062
SET      21.759       94.375
SET      21.887       94.688
SET      22.015       95.000
SET      22.143       95.312
SET      22.271       95.625
SET      22.399       95.938
SET      22.527       96.250
SET      22.655       96.562
SET      22.783       96.875
SET      22.911       97.031
SET      22.911       97.188
SET      23.039       97.344
SET      23.039       97.500
SET      23.167       97.656
SET      23.167       97.812
SET      23.295       97.969
SET      23.423       98.125
SET      23.551       98.281
SET      23.807       98.438
SET      23.935       98.516
SET      24.063       98.594
SET      24.319       98.672
SET      24.703       98.750
SET      25.087       98.828
SET      25.471       98.906
SET      25.983       98.984
SET      26.623       99.062
SET      27.391       99.141
SET      28.159       99.219
SET      28.543       99.258
SET      29.055       99.297
SET      29.567       99.336
SET      30.079       99.375
SET      30.719       99.414
SET      31.359       99.453
SET      32.127       99.492
SET      33.023       99.531
SET      34.047       99.570
SET      35.071       99.609
SET      35.583       99.629
SET      36.095       99.648
SET      36.607       99.668
SET      37.119       99.688
SET      37.631       99.707
SET      38.143       99.727
SET      38.655       99.746
SET      39.423       99.766
SET      40.191       99.785
SET      40.959       99.805
SET      41.215       99.814
SET      41.727       99.824
SET      41.983       99.834
SET      42.495       99.844
SET      43.007       99.854
SET      43.519       99.863
SET      44.031       99.873
SET      44.543       99.883
SET      45.055       99.893
SET      45.567       99.902
SET      46.079       99.907
SET      46.335       99.912
SET      46.591       99.917
SET      47.103       99.922
SET      47.615       99.927
SET      48.127       99.932
SET      48.639       99.937
SET      48.895       99.941
SET      49.407       99.946
SET      50.175       99.951
SET      50.431       99.954
SET      50.943       99.956
SET      51.199       99.958
SET      51.711       99.961
SET      51.967       99.963
SET      52.479       99.966
SET      52.991       99.968
SET      53.503       99.971
SET      54.015       99.973
SET      54.783       99.976
SET      55.039       99.977
SET      55.295       99.978
SET      55.807       99.979
SET      56.063       99.980
SET      56.575       99.982
SET      57.087       99.983
SET      57.343       99.984
SET      58.111       99.985
SET      58.623       99.987
SET      59.135       99.988
SET      59.647       99.988
SET      59.903       99.989
SET      60.159       99.990
SET      61.183       99.990
SET      61.439       99.991
SET      61.951       99.991
SET      62.463       99.992
SET      63.231       99.993
SET      63.743       99.993
SET      63.999       99.994
SET      64.255       99.994
SET      64.767       99.995
SET      65.279       99.995
SET      65.535       99.995
SET      66.047       99.995
SET      66.559       99.996
SET      67.583       99.996
SET      67.583       99.996
SET      68.095       99.997
SET      69.119       99.997
SET      69.631       99.997
SET      69.631       99.997
SET      70.143       99.997
SET      71.167       99.998
SET      72.191       99.998
SET      73.727       99.998
SET      74.751       99.998
SET      74.751       99.998
SET      74.751       99.998
SET      75.263       99.998
SET      75.263       99.999
SET      75.263       99.999
SET      75.775       99.999
SET      75.775       99.999
SET      75.775       99.999
SET      76.287       99.999
SET      76.287       99.999
SET      76.287       99.999
SET      76.799       99.999
SET      80.895       99.999
SET      80.895       99.999
SET      80.895       99.999
SET      81.407       99.999
SET      81.407       99.999
SET      81.407       99.999
SET      82.431       99.999
SET      82.431      100.000
SET      82.431      100.000
SET      84.991      100.000
SET      84.991      100.000
SET      84.991      100.000
[...]
SET      86.015      100.000
SET      86.015      100.000
SET      86.015      100.000
[...]
SET      87.039      100.000
SET      87.039      100.000
SET      87.039      100.000
[...]
SET      97.791      100.000
SET      97.791      100.000
---
GET       0.351        0.000
GET      10.111        5.000
GET      10.751       10.000
GET      10.943       15.000
GET      11.007       20.000
GET      11.135       25.000
GET      11.199       30.000
GET      11.263       35.000
GET      11.327       40.000
GET      11.391       45.000
GET      11.455       50.000
GET      11.455       52.500
GET      11.455       55.000
GET      11.519       57.500
GET      11.519       60.000
GET      11.583       62.500
GET      11.583       65.000
GET      11.647       67.500
GET      11.711       70.000
GET      11.775       72.500
GET      11.839       75.000
GET      11.903       76.250
GET      11.967       77.500
GET      12.031       78.750
GET      12.095       80.000
GET      12.287       81.250
GET      12.479       82.500
GET      12.735       83.750
GET      13.119       85.000
GET      13.503       86.250
GET      13.951       87.500
GET      14.143       88.125
GET      14.399       88.750
GET      14.719       89.375
GET      15.167       90.000
GET      15.871       90.625
GET      17.023       91.250
GET      18.431       91.875
GET      19.711       92.500
GET      20.607       93.125
GET      21.247       93.750
GET      21.503       94.062
GET      21.631       94.375
GET      21.887       94.688
GET      22.015       95.000
GET      22.143       95.312
GET      22.271       95.625
GET      22.399       95.938
GET      22.527       96.250
GET      22.655       96.562
GET      22.783       96.875
GET      22.783       97.031
GET      22.911       97.188
GET      22.911       97.344
GET      23.039       97.500
GET      23.167       97.656
GET      23.167       97.812
GET      23.295       97.969
GET      23.423       98.125
GET      23.551       98.281
GET      23.679       98.438
GET      23.935       98.516
GET      24.063       98.594
GET      24.319       98.672
GET      24.575       98.750
GET      24.959       98.828
GET      25.343       98.906
GET      25.855       98.984
GET      26.495       99.062
GET      27.263       99.141
GET      28.031       99.219
GET      28.415       99.258
GET      28.799       99.297
GET      29.311       99.336
GET      29.951       99.375
GET      30.591       99.414
GET      31.231       99.453
GET      31.999       99.492
GET      33.023       99.531
GET      33.791       99.570
GET      34.815       99.609
GET      35.327       99.629
GET      35.839       99.648
GET      36.351       99.668
GET      37.119       99.688
GET      37.631       99.707
GET      38.143       99.727
GET      38.655       99.746
GET      39.423       99.766
GET      39.935       99.785
GET      40.703       99.805
GET      41.215       99.814
GET      41.471       99.824
GET      41.983       99.834
GET      42.495       99.844
GET      43.007       99.854
GET      43.263       99.863
GET      43.775       99.873
GET      44.543       99.883
GET      45.055       99.893
GET      45.567       99.902
GET      46.079       99.907
GET      46.335       99.912
GET      46.591       99.917
GET      47.103       99.922
GET      47.615       99.927
GET      47.871       99.932
GET      48.383       99.937
GET      49.151       99.941
GET      49.663       99.946
GET      50.175       99.951
GET      50.431       99.954
GET      50.943       99.956
GET      51.199       99.958
GET      51.455       99.961
GET      51.967       99.963
GET      52.479       99.966
GET      52.991       99.968
GET      53.503       99.971
GET      54.015       99.973
GET      54.527       99.976
GET      54.783       99.977
GET      55.295       99.978
GET      55.551       99.979
GET      56.063       99.980
GET      56.319       99.982
GET      56.831       99.983
GET      57.343       99.984
GET      57.855       99.985
GET      58.367       99.987
GET      59.135       99.988
GET      59.391       99.988
GET      59.647       99.989
GET      60.159       99.990
GET      60.671       99.990
GET      61.183       99.991
GET      61.695       99.991
GET      62.463       99.992
GET      62.975       99.993
GET      63.487       99.993
GET      63.743       99.994
GET      63.999       99.994
GET      64.511       99.995
GET      64.767       99.995
GET      65.023       99.995
GET      65.535       99.995
GET      66.047       99.996
GET      67.071       99.996
GET      67.583       99.996
GET      68.095       99.997
GET      69.631       99.997
GET      70.143       99.997
GET      70.655       99.997
GET      71.167       99.997
GET      71.167       99.998
GET      72.191       99.998
GET      72.703       99.998
GET      73.215       99.998
GET      73.215       99.998
GET      74.239       99.998
GET      74.239       99.998
GET      74.751       99.999
GET      74.751       99.999
GET      75.263       99.999
GET      75.775       99.999
GET      75.775       99.999
GET      76.287       99.999
GET      76.799       99.999
GET      76.799       99.999
GET      77.311       99.999
GET      77.823       99.999
GET      77.823       99.999
GET      78.335       99.999
GET      78.335       99.999
GET      78.335       99.999
GET      78.847       99.999
GET      78.847       99.999
GET      78.847      100.000
GET      79.359      100.000
GET      79.871      100.000
GET      80.383      100.000
GET      80.383      100.000
GET      80.895      100.000
GET      81.407      100.000
GET      81.407      100.000
GET      81.919      100.000
GET      81.919      100.000
GET      82.431      100.000
GET      82.431      100.000
GET      82.943      100.000
GET      82.943      100.000
GET      82.943      100.000
[...]
GET      83.455      100.000
GET      83.455      100.000
GET      83.967      100.000
GET      84.479      100.000
GET      84.479      100.000
GET      85.503      100.000
GET      86.527      100.000
GET      87.039      100.000
GET      87.039      100.000
GET      87.039      100.000
GET      87.551      100.000
GET      87.551      100.000
GET      87.551      100.000
[...]
GET      88.063      100.000
GET      88.063      100.000
GET      88.063      100.000
[...]
GET      96.767      100.000
GET      96.767      100.000
GET      96.767      100.000
[...]
GET      97.279      100.000
GET      97.279      100.000
GET      97.279      100.000
[...]
GET     100.351      100.000
GET     100.351      100.000
---
WAIT      0.000      100.000